//Цикли1. Фермеру потрібно на 100 тис. грн. придбати 100 голів скота. 
//Оптова тваринницька агрофірма пропонує поголів'я за наступними цінами: за бика - 10 тис. грн., за корову - 5 тис. грн., за теля - 500 грн.
//Написати програму, яка на основі вказаних вхідних даних обрахує кількість різних видів поголів'я, придбаного фермером.
#include <stdio.h>
#include <stdlib.h>

main()
{
    int money = 0; 
	int bools = 0, cows = 0, colves = 0;
	int head = 0;
	
	do 
	{	 
	
	  if(money < 45000 && head < 90)       
	  {
	  money += 500;                     // - 500 грн +1 теля
	  colves++;              
      }
      
	  if(money == 90000)              
	  {
	  money += 10000;               // - 10тис. +1 бик
	  bools++;                     
      }
      
	  if(money >= 45000 && money < 90000)
	  {
	  money += 5000;             // - 5 тис. +1 корова
	  cows++;                   
      }
	}
	while(money < 100000);  
	printf("bools = %i \ncows = %i \ncovles = %i", bools, cows, colves);   // вивід на екран
}

