//2. Нехай задано масив цілих чисел:
//    int arr[10]=
//    {
//        5, 1, 9, 8, 6, 7, 2, 4, 5, 3
//    };
//Необхідно: 1) оголосити покажчик на масив покажчиків і виділити під нього пам'ять в аналогічній кількості комірок;
//2) заповнити масив покажчиків адресами елементів масиву arr;
//3) здіснити сортування масиву покажчиків таким чином,
//щоб початкова адреса відповідала найменшому елементу масиву arr, а наступні - відповідно, значенням елеменів масиву arr за зростанням.
//В якості перевірки правильності сортування - вивести на екран елементи масиву arr, доступаючись до них через масив покажчиків.
//Важливо! В процесі вирішення задачі масив arr в жодному разі не сортувати!
#include <stdio.h>
#include <stdlib.h>


int main()
{
    int arr[10] = {5, 1 ,9, 8, 6 ,7, 2 ,4, 5, 3};
    int **pointer = (int**)calloc(10, sizeof (int*));
    int i = 0;

    for(i = 0; i < 10; i++){
        pointer[i] = &arr[i];
    }
    for(i = 0; i < 10; i++){
        printf("%p\n", *(pointer + i));
    }



    return 0;
}

